Autodesk.Revit.DB.BuiltInFailures.RegenFailures.UserCancelledError
Operation is cancelled by the user.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.UserCancelled
Operation is cancelled by the user.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.RegeneratedElements
Elements regenerated in pass [Regen Index]

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.RegenFailure
Regeneration Failure.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.RegenElements
Regenerating elements.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.GeomStepFailedError
Can't rebuild geometry.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.GeomStepFailed
Can't rebuild geometry.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.ForceRegenSketch
Regen Sketch

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyWallError
There is a circular chain of references among the highlighted elements.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyWall
There is a circular chain of references among the highlighted elements.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyUncutError
There is a circular chain of references among the highlighted elements.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyUncut
There is a circular chain of references among the highlighted elements.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencySketchError
There is a circular chain of references among the highlighted elements.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencySketch
Constraints in sketches of highlighted elements cause a circular chain of references.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyResolved
There was a circular chain of references among the highlighted elements that was attempted to resolve. User-visible text will
depend on original error returned by offending element.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyError
There is a circular chain of references among the highlighted elements.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyConstraintError
Highlighted constraints cause a circular chain of references.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyConstraint
Highlighted constraints cause a circular chain of references.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyAssocPropError
There is a circular dependency between a Line created with Pick Support and the supporting member.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyAssocProp
There is a circular dependency between a Line created with Pick Support and the supporting member.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependency
There is a circular chain of references among the highlighted elements.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CannotRegenFamily
Can't regenerate Family [Family Name].  Edit Family to modify it.

Autodesk.Revit.DB.BuiltInFailures.RegenFailures
Failures about RegenFailures.